[
    {
        "id":"1",
        "universityName": "Quaid e Azam University",
        "universityLink": "https://qau.edu.pk/",
        "universityRank": "1",
        "speciality": "phds",
        "worldRank": "100",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/download.jpg",
        "merit":"90",
        "sector":"public",
        "admission":"https://qau.edu.pk/message-from-the-admissions-office/",
        "faculty":"https://qau.edu.pk/examinations-office/",
        "fee":"https://qau.edu.pk/fees-structure/",
        "location":"https://maps.app.goo.gl/wHNM57qcEfuNyNfL7",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/qaub1.jpg",
        "backphoto2":"/images/qaub2.jpg",
        "backphoto3":"/images/qaub3.jpg",
        "Description":"The University of Islamabad was established on 22 July 1967 by the Government of Pakistan. It was renamed as Quaid-i-Azam University in honor of Quaid-e-Azam Muhammad Ali Jinnah, founder of Pakistan in 1976 - which was the year of his birth centenary. However, the spelling of the university's name were kept different i.e. i was used instead of e for Ezāfe that links the two words in Jinnah's title Quaid-e-Azam."
    },
    {
        "id":"2",
        "universityName": "NUST University",
        "universityLink": "https://nust.edu.pk/",
        "universityRank": "2",
        "speciality": "Engineering",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/nust.png",
        "merit":"90",
        "admission":"https://nust.edu.pk/admissions/",
        "faculty":"https://nust.edu.pk/academics/",
        "fee":"https://nust.edu.pk/admissions/fee-structure/",
        "sector":"private",
        "location":"https://maps.app.goo.gl/G9hhvumYrLXp4nJ28",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/nustb1.jpg",
        "backphoto2":"/images/nustb2.jpg",
        "backphoto3":"/images/nustb3.jpg",
        "Description":"NUST was established in March 1991. The first college to be affiliated with NUST was MCS in 1992. In 1993, the university was granted a charter and CEME and MCE became part of the university. In December 1994 and November 1995, CAE and PNEC became constituents of NUST respectively. All the constituent colleges were upgraded and MS programmes were started at CAE in September 1997. In 1998, MS programmes were started at PNEC and in the same year, Bachelor of Dental Surgery was started at AMC. In 1999, CEME and CAE attained ISO 9001 Certification, the School of Electrical Engineering and Computer Sciences (SEECS) was launched in Islamabad and NUST Business School (NBS, formerly known as NIMS) was established. School of Mechanical and Manufacturing Engineering (SMME) offers degrees in Mechanical and Biomedical Engineering and is one of the most competitive engineering schools in Pakistan."
     },
    {
        "id":"3",
        "universityName": "Comsats University",
        "universityLink": "https://www.comsats.edu.pk/",
        "universityRank": "3",
        "speciality": "Computer & Tech",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/comsats.jpg",
        "merit":"80",
        "admission":"https://www.comsats.edu.pk/admissions.aspx",
        "faculty":"https://www.comsats.edu.pk/AcademicPrograms.aspx/",
        "fee":"https://www.comsats.edu.pk/NEFiles/Fee-Structure-for-Fall-2023.pdf",
        "sector":"private",
        "location":"https://maps.app.goo.gl/eYpwma7DFEXhytNF7",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/comsatsb1.jpg",
        "backphoto2":"/images/comsatsb2.jpg",
        "backphoto3":"/images/comsatsb3.jpg"
        ,"Description":"The COMSATS University Islamabad (CUI), formerly known as COMSATS Institute of Information Technology (CIIT), is a public university in Pakistan. It is a multi-campus university with its principal seat[5] located in Islamabad. Comsats was envisioned as Pakistan's first exclusive Institute of Information Technology. In the latest QS University Rankings, CUI ranked 7th in Pakistan and 801-1000 in the world. Nationally it is ranked top-most in Computer Sciences and IT category. COMSATS University Islamabad (CUI) is under the administration of the Commission on Science and Technology for Sustainable Development in the South."    
    },
    {
        "id":"4",
        "universityName": "Pieas University",
        "universityLink": "http://www.pieas.edu.pk/",
        "universityRank": "4",
        "speciality": "Engineering",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/piease.jpg",
        "merit":"90",
        "admission":"https://red.pieas.edu.pk/admissions/",
        "faculty":"http://www.pieas.edu.pk/departments.cshtml",
        "fee":"http://admissions.pieas.edu.pk/Academic_Rules/fee_structure.html",
        "sector":"public",
        "location":"",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/pieasb1.jpg",
        "backphoto2":"/images/pieasb2.jpg",
        "backphoto3":"/images/pieasb3.jpg"
        , "Description":"The Pakistan Institute of Engineering and Applied Sciences (PIEAS), (پاکستان انسٹی ٹیوٹ آف انجینئرنگ اینڈ اپلائیڈ سائنسز) is a public research university located in Islamabad, Pakistan. The university is modelled on international standards with a strong focus on the scientific advancement of the nuclear science-related STEM fields. Founded in 1967 as Reactor School from the sponsorship of the Pakistan Atomic Energy Commission in response to support and manage the nuclear energy infrastructure in the country, the institute started its educational activities with the affiliation of Quaid-e-Azam University, and became Centre for Nuclear Studies (CNS) in 1976— the center gained its new name and became independent as public university in 1997. In 2000, the PIEAS was granted the status of a doctorate degree awarding institute. PIEAS is based on a 150 acres (0.61 km2; 0.23 sq mi) campus and has around 135 full-time faculty members. As of 2017, Higher Education Commission rated PIEAS as the 1st leading engineering university in Pakistan. The QS World University Rankings ranked it as 390th worldwide while QS Asia University Rankings ranked it as 3rd in Pakistan, 189th overall in Asia in 2022. It is ranked 47th in QS top 50 under 50."
    },
    {
        "id":"5",
        "universityName": "Bahria University",
        "universityLink": "https://www.bahria.edu.pk/",
        "universityRank": "5",
        "speciality": "Science & Tech",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/bahria.png",
        "merit":"80",
        "admission":"https://bahria.edu.pk/admissions/",
        "faculty":"https://www.bahria.edu.pk/index.php/academics/under-graduate-programs/",
        "fee":"https://www.bahria.edu.pk/index.php/post-graduate-programs-fee/",
        "sector":"private",
        "location":"https://maps.app.goo.gl/xoxwoiCxsucQ9yXb7",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/bahriab1.jpg",
        "backphoto2":"/images/bahriab2.jpg",
        "backphoto3":"/images/bahriab3.jpg"
        ,"Description":"Bahria University (BU; Urdu: جامعہ بحریہ) is a public-sector university established in 2000 by the Pakistan Navy at Shangrilla Road, Sector E-8/1 in Islamabad, Pakistan. The university maintains campuses in Karachi, Islamabad and Lahore. Established by the Pakistan Navy in 2000, its status is semi-government. It offers programs in undergraduate, post-graduate, and doctoral studies. Its research is directed towards the development of engineering, philosophy, natural, social, and medical sciences. Bahria is a comprehensive university having multidisciplinary programs that include Health Sciences, Engineering Sciences, Computer Sciences, Management Sciences, Social Sciences, Law, Earth and Environmental Sciences, Psychology and Maritime Studies. The university is one of the more renowned institutions of higher learning in the country and ranks 23rd in among the country's top thirty and most notable universities in the \"general category\" by the HEC, as of 2016. The university is a member of the Association of Commonwealth Universities of the United Kingdom. The university research institutes offer scientific research in the development of medical, environmental, natural sciences as well as in engineering and philosophy. Bahria University is a founder member of the Education Futures Collaboration charity, an international network of educators working on strategies to bridge the research/practise/policy-making divide."
},
    
    {
        "id":"6",
        "universityName": "FAST University",
        "universityLink": "https://www.nu.edu.pk/",
        "universityRank": "6",
        "speciality": "Computer & Emerginng Science",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/fast.png",
        "merit":"90",
        "admission":"https://www.nu.edu.pk/Admissions/HowToApply",
        "faculty":"https://nu.edu.pk/Admissions/ProgramOffered",
        "fee":"https://www.nu.edu.pk/Admissions/FeeStructure",
        "sector":"private",
        "location":"https://maps.app.goo.gl/QtZCQwYPYcZLWHiK6",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/fastb1.jpg",
        "backphoto2":"/images/fastb2.jpg",
        "backphoto3":"/images/fastb3.webp"
        , "Description":"The university is the first multi-campus university in Pakistan, having five modern campuses based in different cities.[3] These campuses are located in Chiniot-Faisalabad, Islamabad, Karachi, Lahore and Peshawar, providing a standard educational environment and recreational facilities to 11,000 students, out of which 500 are faculty members and a quarter is covered by female students. Founded as Federally Chartered University, it was inaugurated by President Pervez Musharraf in July 2000. It is consistently ranked among the leading institutions of higher education in the country and ranked top in computer sciences and information technology by the Higher Education Commission of Pakistan in 2020.[4] Its engineering programs are accredited with Pakistan Engineering Council.[5] FAST is a not-for-profit educational institution charging subsidized fees from its students. Besides this, FAST offers different financial assistance programs for deserving students in the form of loans. FAST is considered to be very strict in Pakistan."

    },
    {
        "id":"7",
        "universityName": "Air University",
        "universityLink": "https://www.au.edu.pk/",
        "universityRank": "7",
        "speciality": "Science & Tech",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/air.png",
        "merit":"75",
        "sector":"private",
        "admission":"https://www.au.edu.pk/pages/admission/admission_schedule.aspx",
        "faculty":"https://www.airuniversity.af.edu/Academic-Affairs/",
        "fee":"https://www.au.edu.pk/pages/admission/fees_financial.aspx",
        "location":"https://maps.app.goo.gl/YShStkEo3C6CR1Yh8",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/airb1.webp",
        "backphoto2":"/images/airb2.jpg",
        "backphoto3":"/images/airb3.jpg",
        "Description":"The university was established in 2001 with the aim to promote science and technology in Pakistan with Air Marshal Qazi Javed Ahmed appointed as its founding chancellor.[6]\n\nIn August 2001, a feasibility report regarding the university was submitted to then University Grants Commission (UGC, now HEC) for approval.[6] Later, in November 2001, UGC done a detailed inspection of the proposed premises.[6]\n\nIn April 2002, the feasibility report was revised based on the feedback provided by the UGC. Meanwhile, construction of the admin block was started.[6]\n\nIn September 2002, the first batch was admitted and classes began.[6]\n\nIn October 2002, the university received a charter from the president of Pakistan.[6]\n\nIn June 2003, the prime minister of Pakistan inaugurated the university formally and made a contribution of Rs 20 million for the expansion of the university.[6]\n\nIn February 2006, the construction work on the Institute of Avionics and Aeronautics was started.[6]\n\nIn November 2008, Air Commodore Ijaz A Malik was appointed as the second vice-chancellor of the university.[6]\n\nIn March 2011, a new sub-campus of the university in Multan was established.[6]\n\nIn October 2014, Air Vice Marshal Faaiz Amir was appointed as the new vice-chancellor of Air University.[6]\n\nIn January 2020, Air Marshal Javaid Ahmed succeeded Air Vice Marshal Faaiz Amir as the new vice-chancellor.[6]\n\nIn February 2020, Air University Aviation & Aerospace Campus Kamra, located on a land of 50 acres in PAC Kamra became functional.[7]"
       },
    {
        "id":"8",
        "universityName": "Islamic University",
        "universityLink": "https://www.iiu.edu.pk/",
        "universityRank": "8",
        "speciality": "Science & Art's",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/islamic.png",
        "merit":"70",
        "sector":"public",
        "admission":"https://www.iiu.edu.pk/?page_id=1007",
        "faculty":"https://admission.iiu.edu.pk/programes",
        "fee":"https://admission.iiu.edu.pk/fee-structure",
        "location":"https://maps.app.goo.gl/QusvMdRGjRCaDjCs7",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/islamicb1.jpg",
        "backphoto2":"/images/islamicb2.jpg",
        "backphoto3":"/images/islamicb3.jpg"
        ,"Description":"The International Islamic University, Islamabad, or IIUI, is a public research university located in Islamabad, Pakistan. It was established in 1980 and restructured in 1985, and continues to be a significant source for Higher Education in Pakistan. The university is regularly listed among the most recognized universities and prestigious degree awarding institutions of Pakistan by the Higher Education Commission of Pakistan. The university ranks joint second in the 2022 top university rankings of Times Higher Education World University Rankings in Pakistan. It also consistently ranks among the best universities in the country for the general category by Higher Education Commission of Pakistan"
    },
    {
        "id":"9",
        "universityName": "Foundation University",
        "universityLink": "https://fui.edu.pk/",
        "universityRank": "9",
        "speciality": "Science & Art's",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/foundation.png",
        "merit":"70",
        "sector":"public",
        "admission":"https://fui.edu.pk/admissions/Fee-Structure.php",
        "faculty":"https://admissions.fui.edu.pk/#/",
        "fee":"https://fui.edu.pk/admissions/Fee-Structure.php",
        "location":"https://maps.app.goo.gl/QusvMdRGjRCaDjCs7",
        "map":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3317.503510404887!2d73.1355460761675!3d33.74765243375129!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x38dfc11d3571e5bf%3A0x841a9ed6d869644f!2sQuaid-i-Azam%20University%20Islamabad!5e0!3m2!1sen!2s!4v1705244649279!5m2!1sen!2s",
        "zone":"",
        "area":"",
        "backphoto1":"/images/foundationb1.jpg",
        "backphoto2":"/images/foundationb2.jpg",
        "backphoto3":""
        ,"Description":"The Foundation University, Islamabad, is a private sector university located in Islamabad, Pakistan. It was established in 2001 with the aim to promote science and technology in Pakistan. The university is regularly listed among the most recognized universities and prestigious degree awarding institutions of Pakistan by the Higher Education Commission of Pakistan. The university ranks joint second in the 2022 top university rankings of Times Higher Education World University Rankings in Pakistan. It also constantly ranks among the best universities in the country for the general category by Higher Education Commission of Pakistan."
    },
    {
        "id":"10",
        "universityName": "FUUAST University",
        "universityLink": "https://www.fuuastisb.edu.pk/",
        "universityRank": "10",
        "speciality": "Science & Art's",
        "worldRank": "200",
        "onClick": "functionToExecuteOnClick",
        "imageAddress": "/images/fuuast.png",
        "merit":"60",
        "sector":"public",
        "admission":"https://isbadmission.fuuast.edu.pk/",
        "faculty":"https://www.fuuastisb.edu.pk/#work",
        "fee":"https://fuuastisb.edu.pk/admission-images/new%20updated%20fee%20structure.pdf",
        "location":"https://maps.app.goo.gl/eEA2RaVUbtqBQUTU8",
        "map":"",
        "zone":"",
        "area":"",
        "backphoto1":"/images/fuuastb1.jpg",
        "backphoto2":"/images/fuuastb2.jpg",
        "backphoto3":"/images/fuuastb3.jpg"
        ,"Description":"The Federal Urdu University of Arts, Science & Technology enjoys the unique distinction of being the first ever university in Pakistan, which ultimately aims at using Urdu as the main language of instruction and teaching. The university was established on 13th November 2002 under Ordinance No. CXIX of 2002 promulgated by the President of Pakistan. As per provision of this ordinance the university has its principal seat at Islamabad. The university started functioning in November 2002 by taking over two federal government colleges namely Federal Urdu Science College, Karachi and Federal Urdu Arts College, Karachi. The principal seat of the university at Islamabad commenced its teaching programs in November 2003. To begin with, the university established two faculties viz Faculty of Economics and Management Sciences and Faculty of Information Technology and Computer Science with immediate focus on teaching the subjects of Business Administration and Computer Science. The university may establish any number of colleges, institutes and campuses anywhere in or out side Pakistan as may be prescribed."
    }
    
 ]